{
    "length_5": "Narrative: After dinner, he took a shower before he went to bed.\nQuestion: How long did he take a shower?\nAnswer: 20 minutes\n\nA1: He took a shower for 20 minutes.\nA2:\n[with time elapsed]\nA: I finally got home. What a day!\nB: It's eleven p.m. and you just got back home? It must be very tough day today.\nA: Whooa Imma take a shower. I'm too tired.\nB: Wash out all your fatigue with it.\n[20 minutes later]\nA: I feel much better now! You didn't go to bed?\n\n[without time elapsed]\nA: How nice of you :) Give me a moment. brb",
    "length_6": "Narrative: She has taken calculus class and she had a final exam.\nQuestion: How long did she take an exam?\nAnswer: 2 hours\n\nA1: She took the final exam on calculus for 2 hours.\nA2:\n[with time elapsed]\nA: Hey, what are you up to?\nB: I'm gonna take the calculus final exam in 20 minutes. I feel so nervous.\nA: You studied really hard, didn't you? I'm 100% sure you'll do well.\nB: But the last two chapters were too difficult for me to understand.\nA: That means others feel the same. Don't worry too much!\n[2 hours later]\nB: It wasn't much harder than I expected. I hope I get a good grade.\n\n[without time elapsed]\nB: Thank you for cheering me up. I hope the exam is not that hard.",
    "length_7": "Narrative: He enjoyed working out at the gym.\nQuestion: How long did he work out at the gym?\nAnswer: 1 hour 30 minutes\n\nA1: He worked out at the gym for one and a half hours.\nA2:\n[with time elapsed]\nA: I'm going to the gym now. Wanna join me?\nB: I don't feel like working out today. Sorry.\nA: You don't feel good? What happened?\nB: I played football so hard yesterday that I can't even walk right.\nA: Okay, I understand. Maybe next time!\nB: Enjoy your routine! I think I can make it tomorrow.\n[1 hour 30 minutes later]\nA: I focused on my lower body today. Chest tomorrow?\n\n[without time elapsed]\nA: Gonna work out hard on my lower body. Chest tomorrow?",
    "length_8": "Narrative: She had felt so tired that she went to bed right after the tv show.\nQuestion: How long did she sleep?\nAnswer: 8 hours\n\nA1: She slept for 8 hours.\nA2:\n[with time elapsed]\nA: Are you watching the saturday night live?\nB: I'm watching it now but I'm too tired.\nA: I didn't expect today's host is such a comedian lol\nB: Yeah almost the end of the show. I feel like going to bed little bit early.\nA: What made you so tired? You had any plan?\nB: I went to an amusement park with my sister. We had a really good time there.\nA: Oh I see. Think I should let you go. Sleep tight!\n[8 hours later]\nB: Good morning. Did you sleep tight, too?\n\n[without time elapsed]\nB: Good night. I'll text you in the morning. ",
    "length_9": "Narrative: He took an intercity bus to get to his hometown.\nQuestion: How long was he on the bus?\nAnswer: 5 hours\n\nA1: He was on the bus for 5 hours.\nA2:\n[with time elapsed]\nA: What are you going to do on these holidays?\nB: My parents and I usually have dinner together on the Eve.\nA: Me too. So I'm heading to my town right now.\nB: How do you get there? By bus or train?\nA: I used to take trains, but I take an intercity bus for this time.\nB: Why? the tickets' been already sold out?\nA: Unfortunately yes... It will take little bit longer.\nB: Have a nice trip though. Your family must be waiting for you.\n[5 hours later]\nA: Finally I'm back at home! It took almost 5 hours.\n\n[without time elapsed]\nA: I'm gonna sleep all along in the bus. See you a few hours later.",
    "length_10": "Narrative: She played the popular online game with her friends.\nQuestion: How long did she play the game?\nAnswer: 30 minutes\n\nA1: She played the game for 30 minutes.\nA2:\n[with time elapsed]\nA: Have you heard of the League of Legends?\nB: Absolutely! I play it almost everyday with my classmates.\nA: I've heard of, but I've never played if before.\nB: We have a game soon. Wanna join us?\nA: Isn't it a team game? I'm not a good gamer though.\nB: It's not a big deal. They will welcome you.\nA: Well, maybe next time. I need to play it by myself first.\nB: How about getting tutorial with me after this? I'll teach you.\nA: Sounds good. Enjoy your game with your teammates.\n[30 minutes later]\nB: We won! The game was nip and tuck. We were so close to losing.\n\n[without time elapsed]\nB: I'll be back just after the game. Wish me a good luck!"
}